In [1]:
import numpy as np
import pandas as pd

In [13]:
np.random.randn(5)

array([-0.92378457,  0.40586319, -1.11625579,  0.00590648,  0.47883884])

In [15]:
d={'A':[1,2,3],'B':[np.nan,1,1]}

In [19]:
df=pd.DataFrame(d)

In [21]:
df

   A    B
0  1  NaN
1  2  1.0
2  3  1.0

In [24]:
df['A']

0    1
1    2
2    3
Name: A, dtype: int64

In [26]:
type(df['A'])

pandas.core.series.Series

In [29]:
df.dropna()

   A    B
1  2  1.0
2  3  1.0

In [32]:
df.dropna(thresh=2)

   A    B
1  2  1.0
2  3  1.0

In [33]:
df

   A    B
0  1  NaN
1  2  1.0
2  3  1.0

In [36]:
df['B'].fillna(value=df['B'].mean())

0    1.0
1    1.0
2    1.0
Name: B, dtype: float64

In [42]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [43]:
df2=pd.DataFrame(data)

In [45]:
df2

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [48]:
df2.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [57]:
df2.groupby('Company').sum('Sales').loc['FB']

Sales    593
Name: FB, dtype: int64

In [60]:
df2.groupby('Company').min('Sales')

         Sales
Company
FB         243
GOOG       120
MSFT       124

In [63]:
df2.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [91]:
df2.groupby('Company').describe()["Sales"][["count","mean"]]

         count   mean
Company
FB         2.0  296.5
GOOG       2.0  160.0
MSFT       2.0  232.0

In [2]:
df2.groupby('Company').describe().transpose()

NameError: name 'df2' is not defined

In [6]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['k4', 'K5', 'K6', 'K7'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [8]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [10]:
right

  key   C   D
0  k4  C0  D0
1  K5  C1  D1
2  K6  C2  D2
3  K7  C3  D3

In [11]:
pd.merge(left,right,how="inner",on="key")

Empty DataFrame
Columns: [key, A, B, C, D]
Index: []

In [13]:
pd.merge(left,right,how="outer",on="key")

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
4  k4  NaN  NaN   C0   D0
5  K5  NaN  NaN   C1   D1
6  K6  NaN  NaN   C2   D2
7  K7  NaN  NaN   C3   D3

In [15]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [17]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [19]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [21]:
pd.merge(left,right,on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [23]:
pd.merge(left,right,how="outer",on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [25]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [27]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [29]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [31]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [33]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [34]:
left.join(right,how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3